In [14]:
import pandas as pd
import numpy as np

In [15]:
data = np.random.randn(4,3)

In [16]:
data

array([[-0.40231102, -1.31187947, -0.72717437],
       [ 0.11705281, -0.51734523, -0.43240088],
       [ 0.36135332,  0.31993159, -0.32592958],
       [ 0.21432993, -0.24728344,  1.10421189]])

In [17]:
dataFrame = pd.DataFrame(data)

In [18]:
dataFrame

          0         1         2
0 -0.402311 -1.311879 -0.727174
1  0.117053 -0.517345 -0.432401
2  0.361353  0.319932 -0.325930
3  0.214330 -0.247283  1.104212

In [19]:
dataFrame[0]

0   -0.402311
1    0.117053
2    0.361353
3    0.214330
Name: 0, dtype: float64

In [20]:
type(dataFrame[0])

pandas.core.series.Series

In [21]:
yeniDataFrame = pd.DataFrame(data,index=["ömer","nimet","ali","asli"], columns = ["maas","yas","calisma saati"])

In [22]:
yeniDataFrame

           maas       yas  calisma saati
ömer  -0.402311 -1.311879      -0.727174
nimet  0.117053 -0.517345      -0.432401
ali    0.361353  0.319932      -0.325930
asli   0.214330 -0.247283       1.104212

In [23]:
yeniDataFrame["yas"]

ömer    -1.311879
nimet   -0.517345
ali      0.319932
asli    -0.247283
Name: yas, dtype: float64

In [24]:
yeniDataFrame["calisma saati"]

ömer    -0.727174
nimet   -0.432401
ali     -0.325930
asli     1.104212
Name: calisma saati, dtype: float64

In [25]:
yeniDataFrame[["maas","yas"]]

           maas       yas
ömer  -0.402311 -1.311879
nimet  0.117053 -0.517345
ali    0.361353  0.319932
asli   0.214330 -0.247283

In [26]:
yeniDataFrame["ömer"]

KeyError: 'ömer'

In [ ]:
yeniDataFrame.loc["ömer"] #locator

In [ ]:
yeniDataFrame.loc["asli"]

In [ ]:
yeniDataFrame.iloc[3] #index locator

In [ ]:
yeniDataFrame["emeklilik yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]

In [ ]:
yeniDataFrame

In [ ]:
yeniDataFrame.drop("emeklilik yasi")

In [ ]:
yeniDataFrame.drop("emeklilik yasi", axis=1)

In [ ]:
yeniDataFrame.drop("ömer")

In [ ]:
yeniDataFrame.drop("ali",axis=0)

In [ ]:
yeniDataFrame

In [ ]:
yeniDataFrame.drop("emeklilik yasi", axis=1, inplace=True)

In [ ]:
yeniDataFrame #inplace=True sayesinde değiştirilmiş oldu

In [ ]:
yeniDataFrame.loc["ömer"]

In [ ]:
yeniDataFrame.loc["ömer"]["yas"]

In [ ]:
yeniDataFrame.loc["nimet","maas"]

In [ ]:
yeniDataFrame

In [ ]:
yeniDataFrame < 0

In [ ]:
booleanFrame = yeniDataFrame < 0

In [ ]:
booleanFrame

In [ ]:
yeniDataFrame[booleanFrame]

In [ ]:
yeniDataFrame[yeniDataFrame < 0]

In [ ]:
yeniDataFrame["yas"]

In [ ]:
yeniDataFrame["yas"] > 0

In [ ]:
yeniDataFrame[yeniDataFrame["yas"] > 0]

In [27]:
yeniDataFrame[yeniDataFrame["calisma saati"] > 0]

         maas       yas  calisma saati
asli  0.21433 -0.247283       1.104212

In [28]:
# bu şekilde filtreleme yapılabilir

In [29]:
yeniDataFrame

           maas       yas  calisma saati
ömer  -0.402311 -1.311879      -0.727174
nimet  0.117053 -0.517345      -0.432401
ali    0.361353  0.319932      -0.325930
asli   0.214330 -0.247283       1.104212

In [30]:
yeniDataFrame.reset_index()

   index      maas       yas  calisma saati
0   ömer -0.402311 -1.311879      -0.727174
1  nimet  0.117053 -0.517345      -0.432401
2    ali  0.361353  0.319932      -0.325930
3   asli  0.214330 -0.247283       1.104212

In [32]:
yeniDataFrame #inplace true yapmazsan değişmez

           maas       yas  calisma saati
ömer  -0.402311 -1.311879      -0.727174
nimet  0.117053 -0.517345      -0.432401
ali    0.361353  0.319932      -0.325930
asli   0.214330 -0.247283       1.104212

In [33]:
yeniIndexListesi = ["öm","nim","al","as"]

In [34]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

In [35]:
yeniDataFrame

           maas       yas  calisma saati Yeni Indeks
ömer  -0.402311 -1.311879      -0.727174          öm
nimet  0.117053 -0.517345      -0.432401         nim
ali    0.361353  0.319932      -0.325930          al
asli   0.214330 -0.247283       1.104212          as

In [36]:
yeniDataFrame.set_index("Yeni Indeks")

                 maas       yas  calisma saati
Yeni Indeks
öm          -0.402311 -1.311879      -0.727174
nim          0.117053 -0.517345      -0.432401
al           0.361353  0.319932      -0.325930
as           0.214330 -0.247283       1.104212

In [37]:
yeniDataFrame

           maas       yas  calisma saati Yeni Indeks
ömer  -0.402311 -1.311879      -0.727174          öm
nimet  0.117053 -0.517345      -0.432401         nim
ali    0.361353  0.319932      -0.325930          al
asli   0.214330 -0.247283       1.104212          as

In [39]:
yeniDataFrame.set_index("Yeni Indeks", inplace = True)

In [40]:
yeniDataFrame

                 maas       yas  calisma saati
Yeni Indeks
öm          -0.402311 -1.311879      -0.727174
nim          0.117053 -0.517345      -0.432401
al           0.361353  0.319932      -0.325930
as           0.214330 -0.247283       1.104212

In [41]:
yeniDataFrame.loc["öm"]

maas            -0.402311
yas             -1.311879
calisma saati   -0.727174
Name: öm, dtype: float64

# multi indeks

In [42]:
ilkIndeksler = ["GS","GS","GS","FB","FB","FB"]

In [43]:
icIndeksler = ["kerem","baris","berkan","irfan","ferdi","samet"]

In [44]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [45]:
birlesmisIndeks

[('GS', 'kerem'),
 ('GS', 'baris'),
 ('GS', 'berkan'),
 ('FB', 'irfan'),
 ('FB', 'ferdi'),
 ('FB', 'samet')]

In [47]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [49]:
birlesmisIndeks

MultiIndex([('GS',  'kerem'),
            ('GS',  'baris'),
            ('GS', 'berkan'),
            ('FB',  'irfan'),
            ('FB',  'ferdi'),
            ('FB',  'samet')],
           )

In [50]:
takimListem = [[40,"forvet"],[50,"forvet"],[30,"orta"],[50,"orta"],[60,"kanat"],[30,"defans"]]

In [51]:
takimNumpyDizisi = np.array(takimListem)

In [52]:
takimDataFrame = pd.DataFrame(takimNumpyDizisi, index=birlesmisIndeks, columns = ["maaş","pozisyon"])

In [53]:
takimDataFrame

          maaş pozisyon
GS kerem    40   forvet
   baris    50   forvet
   berkan   30     orta
FB irfan    50     orta
   ferdi    60    kanat
   samet    30   defans

In [54]:
takimDataFrame.loc["GS"]

       maaş pozisyon
kerem    40   forvet
baris    50   forvet
berkan   30     orta

In [55]:
takimDataFrame.loc["FB"]

      maaş pozisyon
irfan   50     orta
ferdi   60    kanat
samet   30   defans

In [57]:
takimDataFrame.loc["FB"].loc["ferdi"]

maaş           60
pozisyon    kanat
Name: ferdi, dtype: object

In [59]:
takimDataFrame.index.names = ["Takım Adı","isim"]

In [60]:
takimDataFrame

                 maaş pozisyon
Takım Adı isim
GS        kerem    40   forvet
          baris    50   forvet
          berkan   30     orta
FB        irfan    50     orta
          ferdi    60    kanat
          samet    30   defans